In [3]:
from sqlalchemy import create_engine, text
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as pyplot

In [4]:
database_name = 'scooters'    # Fill this in with your lahman database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [5]:
engine = create_engine(connection_string)


- Are there any null values in any columns in either table?
- What date range is represented in each of the date columns? Investigate any values that seem odd.
- Is time represented with am/pm or using 24 hour values in each of the columns that include time?
- What values are there in the sumdgroup column? Are there any that are not of interest for this project?
- What are the minimum and maximum values for all the latitude and longitude columns? Do these ranges make sense, or is there anything surprising?
-What is the range of values for trip duration and trip distance? Do these values make sense? Explore values that might seem questionable.
- Check out how the values for the company name column in the scooters table compare to those of the trips table. What do you notice?

select count(sumdid), companyname
from scooters
where sumdgroup like 'bicycle'
group by companyname

1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?

In [22]:
query1='''
select distinct sumdid,companyname,sumdgroup
from scooters
WHERE sumdgroup ilike 'scooter'
group by sumdid, companyname, sumdgroup;
'''

with engine.connect() as connection:
    companies = pd.read_sql(text(query1), con = connection)

companies.head()

                                         sumdid companyname sumdgroup
0  Powered-017d3133-f14a-2b83-ee4f-d777e7c5b619        Bolt   Scooter
1  Powered-01a24436-0315-e1bb-7ce0-d081d05dff7d        Bolt   Scooter
2  Powered-03be23ca-d43b-222f-be54-e44b5b4690df        Bolt   Scooter
3  Powered-046201fb-6532-1f37-6334-3612fb1e61f7        Bolt   Scooter
4  Powered-0479bb84-afbd-0426-f1c4-df628542a88c        Bolt   Scooter

In [23]:
total_scoots=companies.groupby(['companyname']).count()
total_scoots=total_scoots.sort_values(by='sumdid',ascending=False)
total_scoots.head(7)

             sumdid  sumdgroup
companyname
Bird           3860       3860
Lime           1818       1818
Lyft           1735       1735
Jump           1210       1210
Spin            805        805
Bolt            360        360
Gotcha          224        224

In [ ]:
ns

In [24]:
query2='''
(select distinct sumdid,companyname, 'May' as month
from scooters
WHERE sumdgroup ilike 'scooter'
and pubdatetime < '2019-06-01 00:00:00'
group by sumdid,companyname
)
UNION
(select distinct sumdid,companyname, 'June' as month
from scooters
WHERE sumdgroup ilike 'scooter'
and pubdatetime < '2019-07-01 00:00:00'
and pubdatetime > '2019-05-31 00:00:00'
group by sumdid,companyname)
UNION
(select distinct sumdid,companyname, 'July' as month
from scooters
WHERE sumdgroup ilike 'scooter'
and pubdatetime > '2019-06-30 00:00:00'
group by sumdid,companyname);
'''

with engine.connect() as connection:
    over_time = pd.read_sql(text(query2), con = connection)

    over_time.head()

In [25]:
by_month=over_time.groupby(['companyname','month'])['sumdid'].count()
by_month=by_month.reset_index() #kept getting an error when trying to sort values, reseting index worked idk why
by_month=by_month.sort_values(by='companyname',ascending=False)
print(by_month)

   companyname month  sumdid
20        Spin   May     687
19        Spin  June     716
18        Spin  July     581
17        Lyft   May    1376
16        Lyft  June    1165
15        Lyft  July    1044
14        Lime   May    1631
13        Lime  June    1472
12        Lime  July     918
11        Jump   May     976
10        Jump  June    1036
9         Jump  July    1206
8       Gotcha   May     223
7       Gotcha  June     223
6       Gotcha  July     224
5         Bolt   May     346
4         Bolt  June     336
3         Bolt  July     278
1         Bird  June    2921
2         Bird   May    3064
0         Bird  July    2662

In [59]:
query3='''
(select companyname, COUNT(distinct triprecordnum) as num_trips, round((sum(tripduration)/60),2) as hours_used, 'May' as month
from trips
where pubtimestamp < '2019-06-01 00:00:00'
and tripduration < 1440
and tripduration > 1
group by companyname
)
UNION
(select companyname, COUNT(distinct triprecordnum) as num_trips, round((sum(tripduration)/60),2) as hours_used,'June' as month
from trips
WHERE pubtimestamp < '2019-07-01 00:00:00'
and pubtimestamp > '2019-05-31 00:00:00'
and tripduration < 1440
and tripduration > 1
group by companyname)
UNION
(select companyname, COUNT(distinct triprecordnum) as num_trips,round((sum(tripduration)/60),2) as hours_used, 'July' as month
from trips
WHERE pubtimestamp > '2019-06-30 00:00:00'
and tripduration < 1440
and tripduration > 1
group by companyname);
'''

with engine.connect() as connection:    
    company_trips = pd.read_sql(text(query3), con = connection)

In [60]:
company_trips=company_trips.reset_index() 
company_trips=company_trips.sort_values(by='companyname',ascending=False)

print(company_trips)

    index    companyname  num_trips  hours_used month
0       0           SPIN       1200     4169.90  July
5       5           SPIN       1579     3089.98   May
15     15           SPIN       1359     5753.65  June
3       3           Lyft       2648    10260.23  June
18     18           Lyft       1849     8066.73  July
12     12           Lyft       3553    14570.77   May
2       2           Lime      10736    21834.57  June
16     16           Lime      38187    10097.47  July
11     11           Lime       6969    27854.34   May
4       4           JUMP        485      240.18   May
6       6           JUMP        389     1761.66  July
19     19           JUMP        446      866.84  June
14     14         Gotcha        183      329.25  June
10     10         Gotcha        143      113.64   May
8       8         Gotcha        174      130.11  July
13     13  Bolt Mobility        513    49736.05  July
1       1  Bolt Mobility       1141    38025.68   May
9       9  Bolt Mobility        883    79514.83  June
17     17           Bird      10283    12640.07  June
7       7           Bird       8995    10570.30  July
20     20           Bird       9063    11986.25   May

2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:  
* Removal of staff servicing and test trips  
* Removal of trips below one minute  
* Trip lengths are capped at 24 hours  
Are the scooter companies in compliance with the second and third part of this rule?

3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

4. What is the highest count of scooters being used at the same time? When did it occur? Does this vary by zip code or other geographic region?

5. SUMDs can provide alternative transportation and provide "last mile" access to public transit. How often are trips starting near public transit hubs? You can download a dataset of bus stop locations from https://data.nashville.gov/Transportation/Regional-Transportation-Authority-Bus-Stops/p886-fnbd